In [52]:
import pandas as pd

In [53]:
import numpy as np

In [54]:
data=np.random.randn(4,3)

In [55]:
data

array([[ 1.25229085, -1.52671853, -0.65755561],
       [-0.20995695,  0.35301545,  0.02005286],
       [ 0.96912361,  0.14241046, -0.55709832],
       [ 0.84901604, -0.97406009, -0.18807392]])

In [56]:
data_frame=pd.DataFrame(data)

In [97]:
data_frame

          0         1         2
0  1.252291 -1.526719 -0.657556
1 -0.209957  0.353015  0.020053
2  0.969124  0.142410 -0.557098
3  0.849016 -0.974060 -0.188074

In [98]:
type(data_frame[0])

pandas.core.series.Series

In [99]:
type(data_frame)

pandas.core.frame.DataFrame

In [100]:
new_df = pd.DataFrame(data,index = ["Atil","Ayse","Ali","Veli"],columns=["Salary","Age","Seniority"])

In [101]:
new_df

        Salary       Age  Seniority
Atil  1.252291 -1.526719  -0.657556
Ayse -0.209957  0.353015   0.020053
Ali   0.969124  0.142410  -0.557098
Veli  0.849016 -0.974060  -0.188074

In [102]:
new_df["Age"]

Atil   -1.526719
Ayse    0.353015
Ali     0.142410
Veli   -0.974060
Name: Age, dtype: float64

In [103]:
new_df["Salary"]

Atil    1.252291
Ayse   -0.209957
Ali     0.969124
Veli    0.849016
Name: Salary, dtype: float64

In [104]:
new_df[["Age","Salary"]]

           Age    Salary
Atil -1.526719  1.252291
Ayse  0.353015 -0.209957
Ali   0.142410  0.969124
Veli -0.974060  0.849016

In [105]:
new_df.loc["Atil"]

Salary       1.252291
Age         -1.526719
Seniority   -0.657556
Name: Atil, dtype: float64

In [106]:
new_df.iloc[0]

Salary       1.252291
Age         -1.526719
Seniority   -0.657556
Name: Atil, dtype: float64

In [107]:
new_df.iloc[1]

Salary      -0.209957
Age          0.353015
Seniority    0.020053
Name: Ayse, dtype: float64

In [69]:
new_df.iloc[: 1]

        Salary       Age  Seniority
Atil  1.252291 -1.526719  -0.657556

In [108]:
new_df["Extra"]=10

In [110]:
new_df

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ayse -0.209957  0.353015   0.020053     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [111]:
new_df.drop("Extra", axis=1)

        Salary       Age  Seniority
Atil  1.252291 -1.526719  -0.657556
Ayse -0.209957  0.353015   0.020053
Ali   0.969124  0.142410  -0.557098
Veli  0.849016 -0.974060  -0.188074

In [112]:
new_df

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ayse -0.209957  0.353015   0.020053     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [113]:
new_df.drop("Ayse")

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [120]:
new_df

        Salary       Age  Seniority  Extra
Atil  1.252291 -1.526719  -0.657556     10
Ali   0.969124  0.142410  -0.557098     10
Veli  0.849016 -0.974060  -0.188074     10

In [121]:
new_df.loc["Ali"]

Salary        0.969124
Age           0.142410
Seniority    -0.557098
Extra        10.000000
Name: Ali, dtype: float64

In [122]:
new_df.loc["Ali"]["Salary"]

np.float64(0.9691236118862703)

In [123]:
new_df.loc["Ali","Salary"]

np.float64(0.9691236118862703)

In [124]:
new_df.loc["Ali","Salary"]=1000

In [125]:
new_df

           Salary       Age  Seniority  Extra
Atil     1.252291 -1.526719  -0.657556     10
Ali   1000.000000  0.142410  -0.557098     10
Veli     0.849016 -0.974060  -0.188074     10

In [126]:
boolean_frame =new_df > 0

In [127]:
new_df[boolean_frame]

           Salary      Age  Seniority  Extra
Atil     1.252291      NaN        NaN     10
Ali   1000.000000  0.14241        NaN     10
Veli     0.849016      NaN        NaN     10

In [128]:
new_df[new_df>0]

           Salary      Age  Seniority  Extra
Atil     1.252291      NaN        NaN     10
Ali   1000.000000  0.14241        NaN     10
Veli     0.849016      NaN        NaN     10

In [130]:
new_df[new_df["Salary"]>1]

           Salary       Age  Seniority  Extra
Atil     1.252291 -1.526719  -0.657556     10
Ali   1000.000000  0.142410  -0.557098     10

In [131]:
new_df

           Salary       Age  Seniority  Extra
Atil     1.252291 -1.526719  -0.657556     10
Ali   1000.000000  0.142410  -0.557098     10
Veli     0.849016 -0.974060  -0.188074     10

In [132]:
new_df.reset_index()

  index       Salary       Age  Seniority  Extra
0  Atil     1.252291 -1.526719  -0.657556     10
1   Ali  1000.000000  0.142410  -0.557098     10
2  Veli     0.849016 -0.974060  -0.188074     10

In [134]:
reset_frame = new_df.reset_index()

In [135]:
reset_frame

  index       Salary       Age  Seniority  Extra
0  Atil     1.252291 -1.526719  -0.657556     10
1   Ali  1000.000000  0.142410  -0.557098     10
2  Veli     0.849016 -0.974060  -0.188074     10

In [136]:
reset_frame.iloc[0]

index            Atil
Salary       1.252291
Age         -1.526719
Seniority   -0.657556
Extra              10
Name: 0, dtype: object

In [137]:
reset_frame.iloc[1]

index             Ali
Salary         1000.0
Age           0.14241
Seniority   -0.557098
Extra              10
Name: 1, dtype: object

In [140]:
new_indices = ["Ati", "Zey", "Meh"]

In [141]:
new_df["NewIndex"] = new_indices

In [142]:
new_df

           Salary       Age  Seniority  Extra NewIndex
Atil     1.252291 -1.526719  -0.657556     10      Ati
Ali   1000.000000  0.142410  -0.557098     10      Zey
Veli     0.849016 -0.974060  -0.188074     10      Meh

In [143]:
new_df.set_index("NewIndex", inplace=True)

In [144]:
new_df

               Salary       Age  Seniority  Extra
NewIndex
Ati          1.252291 -1.526719  -0.657556     10
Zey       1000.000000  0.142410  -0.557098     10
Meh          0.849016 -0.974060  -0.188074     10

In [145]:
new_df.loc["Ati"]

Salary        1.252291
Age          -1.526719
Seniority    -0.657556
Extra        10.000000
Name: Ati, dtype: float64

In [146]:
# multi index

In [150]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [ ]:
inner_index= ["Homer", "Marge", "Bart", "Cartman", "Kenny", "Kyle"]

In [151]:
zipped_index = list(zip(first_index, inner_index))

In [152]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Marge'),
 ('Simpson', 'Bart'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [153]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [154]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',   'Marge'),
            (   'Simpson',    'Bart'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [155]:
sample_values = np.ones((6,2))

In [157]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns=["Age", "Salary"])

In [158]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Marge    1.0     1.0
           Bart     1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [159]:
big_df["Age"]

Simpson     Homer      1.0
            Marge      1.0
            Bart       1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [160]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Marge  1.0     1.0
Bart   1.0     1.0

In [162]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64